# Create Method (Int32, Int32, IList(XYZ), Boolean, Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSurface..::..Create Method (Int32, Int32, IList<(Of <(<'XYZ>)>)>, Boolean, Boolean)
HermiteSurface Class See Also
---
Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static HermiteSurface Create(
	int nU,
	int nV,
	IList<XYZ> points,
	bool periodicU,
	bool periodicV
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	nU As Integer, _
	nV As Integer, _
	points As IList(Of XYZ), _
	periodicU As Boolean, _
	periodicV As Boolean _
) As HermiteSurface
```

Visual C++
---
```text
public:
static HermiteSurface^ Create(
	int nU,
	int nV,
	IList<XYZ^>^ points,
	bool periodicU,
	bool periodicV
)
```

# ### Parameters
nU
    Type: System..::..Int32 Number of points in U direction.
nV
    Type: System..::..Int32 Number of points in V direction.
points
    Type: System.Collections.Generic..::..IList<(Of <(<'XYZ>)>)> Array of points. Must contain nU*nV points.
periodicU
    Type: System..::..Boolean Periodicity in U direction
periodicV
    Type: System..::..Boolean Periodicity in V direction
# ### Return Value
A Hermite surface object created from input data.
# Remarks
Points form a net of nU * nV (less one each if periodic) 3D points.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | Thrown when the input arguments are inconsistent. The most common case is incorrect number of items in one of the lists. |

# See Also
HermiteSurface Class
Create Overload
Autodesk.Revit.DB Namespace